{
    "drcho_bio": "Dr. Cho is a distinguished and highly respected figure in the field of neurology, with over 35 years of unwavering commitment to providing exceptional patient care and advancing the understanding and treatment of neurological conditions. As a board-certified neurologist and double-board certified epilepsy specialist, Dr. Cho's expertise spans a wide spectrum, reflecting his unparalleled dedication to improving the lives of those he serves.\nExceptional Private Practice and Affiliation with Cedars-Sinai Medical Center\nFor more than three decades, Dr. Cho has been a beacon of excellence in the medical community. His own private practice has been a haven for patients seeking comprehensive and personalized neurological care. Through his meticulous diagnostic approach and tailored treatment plans, he has earned a reputation for his compassionate bedside manner and unparalleled expertise.\n\nDr. Cho's influence extends beyond his private practice, as he is currently affiliated with the esteemed Cedars-Sinai Medical Center. This affiliation underscores his commitment to staying at the forefront of medical advancements and collaborating with other top professionals in the field.\nEducator and Scholar: UCLA and USC Contributions\nDr. Cho's dedication to education and scholarly pursuits has left an indelible mark on both the University of California, Los Angeles (UCLA) and the University of Southern California (USC). He served as a former Clinical Associate Professor of Neurology at UCLA, where he imparted his knowledge and passion to aspiring medical professionals. In recognition of his profound contributions to the field, he was also a valued board member of USC's Geriatric Medicine program, where he contributed his expertise to addressing the unique neurological needs of older adults.\nGlobal Education and Training\nDr. Cho's journey to becoming a respected neurologist and epilepsy specialist began at Seoul National University Medical School, where he obtained his medical degree. His quest for excellence led him to Boston City Hospital, affiliated with Harvard Medical School, for his residency experience. This pivotal phase of his education solidified his foundation in medical expertise and ignited his lifelong commitment to pushing the boundaries of neurological science.\n\nA Legacy of Empowerment and Advancement\nThroughout his illustrious career, Dr. Cho has demonstrated a profound commitment to advancing medical knowledge, pioneering treatments, and enhancing patient well-being. His dedication to neurological medicine, coupled with his warmth and empathy, has touched the lives of countless individuals and their families. Dr. Cho's legacy is one of empowerment, compassion, and unrelenting pursuit of excellence in neurological care.\nToday, as a revered figure in the field of neurology and epilepsy, Dr. Cho continues to inspire fellow professionals and uplift the lives of his patients. His passion, expertise, and boundless contributions have shaped the landscape of neurological medicine, making him a true luminary in the pursuit of optimal neurological health."
    ,
    "drko_bio": "."
    ,
    "check_list_alzheimer": [
        "History and Physical",
        "MoCA",
        "Lab tests(Vitamin B12 and thyroid panel)",
        "Medication List",
        "MRI of Brain report",
        "Biomarkers",
        "Beta Amiloid PET Scan",
        "APoE4 status"
    ] 
    ,
    "risk_factors": [
        "Vit B12",
        "Stroke",
        "Trauma",
        "Thyroid",
        "Syphilis",
        "Other infection, HIV Etc..",
        "Female",
        "Family History",
        "Age",
        "ApoE4",
        "High Humocysteine Level",
        "Smoke",
        "HTN/D.M",
        "Cholesterol",
        "Diabetes",
        "Social Isolation",
        "Medications side Effect"
    ],
    "memoryclinic": [
        "Dr.Cho's evaluation for Memory loss",
        "Special Lab test and PET Scan",
        "2 weeks later meet Dr.Cho",
        "3 weeks Dr.Cho Treatment plans",
        "Syphilis",
        "Other infection, HIV Etc..",
        "Female",
        "Family History",
        "Age",
        "ApoE4",
        "High Humocysteine Level",
        "Smoke",
        "HTN/D.M",
        "Cholesterol",
        "Diabetes",
        "Social Isolation",
        "Medications side Effect"
    ]
}